app/views/items/show.html.erb

        <% @item.offers.each do |offer| %>
          <li>Value:<%= offer.value %> Message:<%= offer.message%> <%if offer.user %> -From: <%= offer.user.email %><%end%></li>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]